betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_qspi.h
/**
  *
  * @file    apm32f4xx_dal_qspi.h
  * @brief   Header file of QSPI DAL module.
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification, 
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2017 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __APM32F4XX_DAL_QSPI_H
#define __APM32F4XX_DAL_QSPI_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "apm32f4xx_dal_def.h"

#if defined (QSPI)

/** @addtogroup APM32F4xx_DAL_Driver
  * @{
  */

/** @addtogroup QSPI
 * @{
 */

/* Exported types ------------------------------------------------------------*/
/** @defgroup QSPI_Exported_Types QSPI Exported Types
  * @{
  */

/**
 * @brief  QSPI Init structure definition
 */
typedef struct
{
    uint32_t ClockPrescaler;        /*!< Specifies the prescaler factor for generating clock based on the AHB clock.
                                         This parameter can be a even number between 2 and 65534. */

#if defined(QSPI_CTRL1_CPHA)
    uint32_t ClockPhase;            /*!< Specifies the clock data sample edge.
                                         This parameter can be a value of @ref QSPI_ClockPhase */
#endif /* QSPI_CTRL1_CPHA */

#if defined(QSPI_CTRL1_CPOL)
    uint32_t ClockPolarity;         /*!< Specifies the clock valid level in the idle state.
                                         This parameter can be a value of @ref QSPI_ClockPolarity */
#endif /* QSPI_CTRL1_CPOL */

    uint32_t ClockStretch;          /*!< Specifies the clock stretch enable/disable.
                                         This parameter can be a value of ENABLE or DISABLE */

    uint32_t TxFifoThreshold;       /*!< Specifies the threshold level of the transmit FIFO.
                                         This parameter can be a value between 0 and 7. */

    uint32_t TxFifoLevel;           /*!< Specifies the level of the transmit FIFO startup level.
                                         This parameter can be a value between 0 and 7. */

    uint32_t RxFifoThreshold;       /*!< Specifies the threshold level of the receive FIFO.
                                            This parameter can be a value between 0 and 7. */

    uint32_t ChipSelectToggle;      /*!< Specifies the Chip Select Toggle.
                                         This parameter can be a value of @ref QSPI_ChipSelectToggle */
} QSPI_InitTypeDef;

/**
 * @brief DAL QSPI State structures definition
 */
typedef enum
{
    DAL_QSPI_STATE_RESET             = 0x00,  /*!< QSPI not yet initialized or disabled                 */
    DAL_QSPI_STATE_READY             = 0x01,  /*!< QSPI initialized and ready for use                   */
    DAL_QSPI_STATE_BUSY              = 0x02,  /*!< QSPI internal process is ongoing                     */
    DAL_QSPI_STATE_BUSY_TX           = 0x12,  /*!< Data Transmission process is ongoing                 */
    DAL_QSPI_STATE_BUSY_RX           = 0x22,  /*!< Data Reception process is ongoing                    */
    DAL_QSPI_STATE_BUSY_TX_RX        = 0x42,  /*!< Data Transmission and Reception process is ongoing   */
    DAL_QSPI_STATE_ERROR             = 0x04,  /*!< QSPI error state                                     */
    DAL_QSPI_STATE_ABORT             = 0x08,  /*!< QSPI abort is ongoing                                */
} DAL_QSPI_StateTypeDef;

/**
 * @brief  QSPI handle Structure definition
 */
#if (USE_DAL_QSPI_REGISTER_CALLBACKS == 1)
typedef struct __QSPI_HandleTypeDef
#else
typedef struct
#endif
{
    QSPI_TypeDef                *Instance;      /*!< QSPI registers base address               */

    QSPI_InitTypeDef            Init;           /*!< QSPI communication parameters             */

    uint8_t                     *pTxBuffPtr;    /*!< Pointer to QSPI Tx transfer Buffer        */

    __IO uint32_t               TxXferSize;     /*!< QSPI Tx Transfer size                     */

    __IO uint32_t               TxXferCount;    /*!< QSPI Tx Transfer Counter                  */

    uint8_t                     *pRxBuffPtr;    /*!< Pointer to QSPI Rx transfer Buffer        */

    __IO uint32_t               RxXferSize;     /*!< QSPI Rx Transfer size                     */

    __IO uint32_t               RxXferCount;    /*!< QSPI Rx Transfer Counter                  */

    DMA_HandleTypeDef          *hdmatx;         /*!< QSPI Tx DMA handle parameters             */

    DMA_HandleTypeDef          *hdmarx;         /*!< QSPI Rx DMA handle parameters             */

