betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_qspi.h
    __IO DAL_LockTypeDef        Lock;           /*!< QSPI locking object                       */

    __IO DAL_QSPI_StateTypeDef  State;          /*!< QSPI communication state                  */

    __IO uint32_t               ErrorCode;      /*!< QSPI Error code                           */

    uint32_t                    Timeout;        /*!< QSPI timeout value                        */
#if (USE_DAL_QSPI_REGISTER_CALLBACKS == 1)
    void (* ErrorCallback)                  (struct __QSPI_HandleTypeDef *hqspi);               /*!< QSPI Error Callback               */
    void (* AbortCpltCallback)              (struct __QSPI_HandleTypeDef *hqspi);               /*!< QSPI Abort Complete Callback      */
    void (* CmdCpltCallback)                (struct __QSPI_HandleTypeDef *hqspi);               /*!< QSPI Command Complete Callback    */
    void (* RxCpltCallback)                 (struct __QSPI_HandleTypeDef *hqspi);               /*!< QSPI Rx Complete Callback         */
    void (* TxCpltCallback)                 (struct __QSPI_HandleTypeDef *hqspi);               /*!< QSPI Tx Complete Callback         */
    void (* TxRxCpltCallback)               (struct __QSPI_HandleTypeDef *hqspi);               /*!< QSPI Transfer Complete Callback   */

    void (* MspInitCallback)                (struct __QSPI_HandleTypeDef *hqspi);               /*!< QSPI Msp Init callback            */
    void (* MspDeInitCallback)              (struct __QSPI_HandleTypeDef *hqspi);               /*!< QSPI Msp DeInit callback          */
#endif /* USE_DAL_QSPI_REGISTER_CALLBACKS */
} QSPI_HandleTypeDef;

/**
  * @brief  QSPI Command structure definition
  */
typedef struct
{
    uint32_t Instruction;       /*!< Specifies the Instruction to be sent.
                                     This parameter can be a value between 0x00 and 0xFF */

    uint32_t Address;           /*!< Specifies the Address to be sent.
                                     This parameter can be a value between 0x00 and 0xFFFFFFFF */

    uint32_t AddressSize;       /*!< Specifies the Address Size.
                                     This parameter can be a value of @ref QSPI_AddressSize */

    uint32_t InstructionMode;   /*!< Specifies the Instruction Mode.
                                     This parameter can be a value of @ref QSPI_InstructionMode */

    uint32_t InstructionSize;   /*!< Specifies the Instruction Size.
                                     This parameter can be a value of @ref QSPI_InstructionSize */

    uint32_t TransferMode;      /*!< Specifies the Transfer Mode.
                                     This parameter can be a value of @ref QSPI_TransferMode */

    uint32_t FrameFormat;       /*!< Specifies the frame format.
                                         This parameter can be a value of @ref QSPI_FrameFormat */

    uint32_t DataFrameSize;     /*!< Specifies the data frame size.
                                         This parameter can be a value of @ref QSPI_DataFrameSize */

    uint32_t DummyCycles;       /*!< Specifies the Number of Dummy Cycles.
                                     This parameter can be a number between 0 and 31 */

    uint32_t NbData;            /*!< Specifies the Number of Data to transfer.
                                     This parameter can be a number between 0 and 0xFFFF */
} QSPI_CommandTypeDef;

#if (USE_DAL_QSPI_REGISTER_CALLBACKS == 1)
/**
  * @brief  DAL QSPI Callback ID enumeration definition
  */
typedef enum
{
    DAL_QSPI_ERROR_CB_ID                   = 0x00U,    /*!< QSPI Error Callback ID               */
    DAL_QSPI_ABORT_CB_ID                   = 0x01U,    /*!< QSPI Abort Callback ID               */
    DAL_QSPI_CMD_CPLT_CB_ID                = 0x02U,    /*!< QSPI Command Complete Callback ID    */
    DAL_QSPI_RX_CPLT_CB_ID                 = 0x03U,    /*!< QSPI Rx Complete Callback ID         */
    DAL_QSPI_TX_CPLT_CB_ID                 = 0x04U,    /*!< QSPI Tx Complete Callback ID         */
    DAL_QSPI_TX_RX_CPLT_CB_ID              = 0x05U,    /*!< QSPI Transfer Complete Callback ID   */

    DAL_QSPI_MSP_INIT_CB_ID                = 0x06U,    /*!< QSPI MspInit callback ID             */
    DAL_QSPI_MSP_DEINIT_CB_ID              = 0x07U     /*!< QSPI MspDeInit callback ID           */
} DAL_QSPI_CallbackIDTypeDef;

/**
  * @brief  DAL QSPI Callback pointer definition
  */
typedef  void (*pQSPI_CallbackTypeDef)(QSPI_HandleTypeDef *hqspi); /*!< pointer to an QSPI callback function */
#endif /* USE_DAL_QSPI_REGISTER_CALLBACKS */

/**
* @}
*/

/* Exported constants --------------------------------------------------------*/
/** @defgroup QSPI_Exported_Constants QSPI Exported Constants
  * @{
  */

/** @defgroup QSPI_Error_Code QSPI Error Code
 * @{
 */
#define DAL_QSPI_ERROR_NONE              0x00000000U    /*!< No error              */
#define DAL_QSPI_ERROR_TIMEOUT           0x00000001U    /*!< Timeout error         */
#define DAL_QSPI_ERROR_TRANSFER          0x00000002U    /*!< Transfer error        */
#define DAL_QSPI_ERROR_DMA               0x00000004U    /*!< DMA transfer error    */
#define DAL_QSPI_ERROR_TX_OVR            0x00000008U    /*!< Transmit FIFO Overrun */
#define DAL_QSPI_ERROR_RX_OVR            0x00000010U    /*!< Receive FIFO Overrun  */
#define DAL_QSPI_ERROR_RX_UDR            0x00000020U    /*!< Receive FIFO UnderRun */
#define DAL_QSPI_ERROR_MST               0x00000040U    /*!< Master operation error*/
#define DAL_QSPI_ERROR_INVALID_PARAM     0x00000080U    /*!< Invalid parameter error */
#if (USE_DAL_QSPI_REGISTER_CALLBACKS == 1)
#define DAL_QSPI_ERROR_INVALID_CALLBACK  0x00000100U    /*!< Invalid Callback error */
#endif /* USE_DAL_QSPI_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup QSPI_FrameFormat QSPI Frame Format
 * @{
 */
#define QSPI_FRAME_FORMAT_STANDARD    0x00000000U               /*!< QSPI Standard frame format */
#define QSPI_FRAME_FORMAT_DUAL        QSPI_CTRL1_FRF_0          /*!< QSPI Dual frame format     */
#define QSPI_FRAME_FORMAT_QUAD        QSPI_CTRL1_FRF_1          /*!< QSPI Quad frame format     */
/**
  * @}
  */

/** @defgroup QSPI_DataFrameSize QSPI Data Frame Size
 * @{
 */
#define QSPI_DATA_FRAME_SIZE_4BITS    0x00000003U               /*!< QSPI data frame size 4 bits  */
#define QSPI_DATA_FRAME_SIZE_5BITS    0x00000004U               /*!< QSPI data frame size 5 bits  */
#define QSPI_DATA_FRAME_SIZE_6BITS    0x00000005U               /*!< QSPI data frame size 6 bits  */
#define QSPI_DATA_FRAME_SIZE_7BITS    0x00000006U               /*!< QSPI data frame size 7 bits  */
#define QSPI_DATA_FRAME_SIZE_8BITS    0x00000007U               /*!< QSPI data frame size 8 bits  */
#define QSPI_DATA_FRAME_SIZE_9BITS    0x00000008U               /*!< QSPI data frame size 9 bits  */
#define QSPI_DATA_FRAME_SIZE_10BITS   0x00000009U               /*!< QSPI data frame size 10 bits */
#define QSPI_DATA_FRAME_SIZE_11BITS   0x0000000AU               /*!< QSPI data frame size 11 bits */
#define QSPI_DATA_FRAME_SIZE_12BITS   0x0000000BU               /*!< QSPI data frame size 12 bits */
#define QSPI_DATA_FRAME_SIZE_13BITS   0x0000000CU               /*!< QSPI data frame size 13 bits */
#define QSPI_DATA_FRAME_SIZE_14BITS   0x0000000DU               /*!< QSPI data frame size 14 bits */
#define QSPI_DATA_FRAME_SIZE_15BITS   0x0000000EU               /*!< QSPI data frame size 15 bits */
#define QSPI_DATA_FRAME_SIZE_16BITS   0x0000000FU               /*!< QSPI data frame size 16 bits */
#define QSPI_DATA_FRAME_SIZE_17BITS   0x00000010U               /*!< QSPI data frame size 17 bits */
#define QSPI_DATA_FRAME_SIZE_18BITS   0x00000011U               /*!< QSPI data frame size 18 bits */
#define QSPI_DATA_FRAME_SIZE_19BITS   0x00000012U               /*!< QSPI data frame size 19 bits */
#define QSPI_DATA_FRAME_SIZE_20BITS   0x00000013U               /*!< QSPI data frame size 20 bits */
#define QSPI_DATA_FRAME_SIZE_21BITS   0x00000014U               /*!< QSPI data frame size 21 bits */
#define QSPI_DATA_FRAME_SIZE_22BITS   0x00000015U               /*!< QSPI data frame size 22 bits */
#define QSPI_DATA_FRAME_SIZE_23BITS   0x00000016U               /*!< QSPI data frame size 23 bits */
#define QSPI_DATA_FRAME_SIZE_24BITS   0x00000017U               /*!< QSPI data frame size 24 bits */
#define QSPI_DATA_FRAME_SIZE_25BITS   0x00000018U               /*!< QSPI data frame size 25 bits */
#define QSPI_DATA_FRAME_SIZE_26BITS   0x00000019U               /*!< QSPI data frame size 26 bits */
#define QSPI_DATA_FRAME_SIZE_27BITS   0x0000001AU               /*!< QSPI data frame size 27 bits */
#define QSPI_DATA_FRAME_SIZE_28BITS   0x0000001BU               /*!< QSPI data frame size 28 bits */
#define QSPI_DATA_FRAME_SIZE_29BITS   0x0000001CU               /*!< QSPI data frame size 29 bits */
#define QSPI_DATA_FRAME_SIZE_30BITS   0x0000001DU               /*!< QSPI data frame size 30 bits */
#define QSPI_DATA_FRAME_SIZE_31BITS   0x0000001EU               /*!< QSPI data frame size 31 bits */
#define QSPI_DATA_FRAME_SIZE_32BITS   0x0000001FU               /*!< QSPI data frame size 32 bits */

/**
  * @}
  */

#if defined(QSPI_CTRL1_CPHA)
/** @defgroup QSPI_ClockPhase QSPI Clock Phase
 * @{
 */
#define QSPI_CLOCK_PHASE_1ST_EDGE     0x00000000U               /*!< QSPI clock active high on the first edge and inactive low on the second edge */
#define QSPI_CLOCK_PHASE_2ND_EDGE     QSPI_CTRL1_CPHA           /*!< QSPI clock active low on the first edge and inactive high on the second edge */
/**
  * @}
  */
#endif /* QSPI_CTRL1_CPHA */

#if defined(QSPI_CTRL1_CPOL)
/** @defgroup QSPI_ClockPolarity QSPI Clock Polarity
 * @{
 */
#define QSPI_CLOCK_POLARITY_LOW       0x00000000U               /*!< QSPI clock inactive state is low  */
#define QSPI_CLOCK_POLARITY_HIGH      QSPI_CTRL1_CPOL           /*!< QSPI clock inactive state is high */
/**
  * @}
  */
#endif /* QSPI_CTRL1_CPOL */

