betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_qspi.h
/** @defgroup QSPI_ChipSelectToggle QSPI Chip Select ChipSelectToggle
 * @{
 */
#define QSPI_CS_TOGGLE_DISABLE        0x00000000U               /*!< QSPI chip select signal doesn't toggle between frames */
#define QSPI_CS_TOGGLE_ENABLE         QSPI_CTRL1_SSTEN          /*!< QSPI chip select signal toggles between frames        */
/**
  * @}
  */

/** @defgroup QSPI_TransferMode QSPI Transfer Mode
 * @{
 */
#define QSPI_TRANSFER_MODE_TX_RX        0x00000000U                                 /*!< QSPI in transmit/receive mode */
#define QSPI_TRANSFER_MODE_TX           QSPI_CTRL1_TXMODE_0                         /*!< QSPI in transmit only mode    */
#define QSPI_TRANSFER_MODE_RX           QSPI_CTRL1_TXMODE_1                         /*!< QSPI in receive only mode     */
#define QSPI_TRANSFER_MODE_EEPROM_READ  (QSPI_CTRL1_TXMODE_1 | QSPI_CTRL1_TXMODE_0) /*!< QSPI in EEPROM read mode */
/**
  * @}
  */

/** @defgroup QSPI_RXDSampleEdge QSPI RXD Sample Edge
 * @{
 */
#define QSPI_RXD_SAMPLE_EDGE_RISING     0x00000000U         /*!< QSPI RXD sample on rising edge  */
#define QSPI_RXD_SAMPLE_EDGE_FALLING    QSPI_RSD_RSE        /*!< QSPI RXD sample on falling edge */
/**
  * @}
  */

/** @defgroup QSPI_InstructionSize QSPI Instruction Size
 * @{
 */
#define QSPI_INSTRUCTION_SIZE_NONE      0x00000000U                                     /*!< No instruction         */
#define QSPI_INSTRUCTION_SIZE_4_BITS    QSPI_CTRL3_INSLEN_0                             /*!< Instruction on 4 bits  */
#define QSPI_INSTRUCTION_SIZE_8_BITS    QSPI_CTRL3_INSLEN_1                             /*!< Instruction on 8 bits  */
#define QSPI_INSTRUCTION_SIZE_16_BITS   (QSPI_CTRL3_INSLEN_1 | QSPI_CTRL3_INSLEN_0)     /*!< Instruction on 16 bits */
/**
  * @}
  */

/** @defgroup QSPI_InstructionMode QSPI Instruction Mode
 * @{
 */
#define QSPI_INSTRUCTION_STANDARD_INS_ADDR      0x00000000U                                 /*!< Send instruction and address in standard SPI mode */
#define QSPI_INSTRUCTION_STANDARD_INS           QSPI_CTRL3_IAT_0                            /*!< Send instruction only in standard SPI mode        */
#define QSPI_INSTRUCTION_FRF_INS_ADDR           QSPI_CTRL3_IAT_1                            /*!< Send instruction and address in FRF mode          */
/**
  * @}
  */

/** @defgroup QSPI_AddressSize QSPI Address Size
 * @{
 */
#define QSPI_ADDRESS_SIZE_NONE           0x00000000U                                         /*!< No address         */
#define QSPI_ADDRESS_SIZE_4_BITS         (QSPI_CTRL3_ADDRLEN_0)                              /*!< Address on 4 bits  */
#define QSPI_ADDRESS_SIZE_8_BITS         (QSPI_CTRL3_ADDRLEN_1)                              /*!< Address on 8 bits  */
#define QSPI_ADDRESS_SIZE_12_BITS        (QSPI_CTRL3_ADDRLEN_1 | QSPI_CTRL3_ADDRLEN_0)       /*!< Address on 12 bits */
#define QSPI_ADDRESS_SIZE_16_BITS        (QSPI_CTRL3_ADDRLEN_2)                              /*!< Address on 16 bits */
#define QSPI_ADDRESS_SIZE_20_BITS        (QSPI_CTRL3_ADDRLEN_2 | QSPI_CTRL3_ADDRLEN_0)       /*!< Address on 20 bits */
#define QSPI_ADDRESS_SIZE_24_BITS        (QSPI_CTRL3_ADDRLEN_2 | QSPI_CTRL3_ADDRLEN_1)       /*!< Address on 24 bits */
#define QSPI_ADDRESS_SIZE_28_BITS        (QSPI_CTRL3_ADDRLEN_2 | QSPI_CTRL3_ADDRLEN_1 |      \
                                         QSPI_CTRL3_ADDRLEN_0)                               /*!< Address on 28 bits */
#define QSPI_ADDRESS_SIZE_32_BITS        (QSPI_CTRL3_ADDRLEN_3)                              /*!< Address on 32 bits */
#define QSPI_ADDRESS_SIZE_36_BITS        (QSPI_CTRL3_ADDRLEN_3 | QSPI_CTRL3_ADDRLEN_0)       /*!< Address on 36 bits */
#define QSPI_ADDRESS_SIZE_40_BITS        (QSPI_CTRL3_ADDRLEN_3 | QSPI_CTRL3_ADDRLEN_1)       /*!< Address on 40 bits */
#define QSPI_ADDRESS_SIZE_44_BITS        (QSPI_CTRL3_ADDRLEN_3 | QSPI_CTRL3_ADDRLEN_1 |      \
                                         QSPI_CTRL3_ADDRLEN_0)                               /*!< Address on 44 bits */
#define QSPI_ADDRESS_SIZE_48_BITS        (QSPI_CTRL3_ADDRLEN_3 | QSPI_CTRL3_ADDRLEN_2)       /*!< Address on 48 bits */
#define QSPI_ADDRESS_SIZE_52_BITS        (QSPI_CTRL3_ADDRLEN_3 | QSPI_CTRL3_ADDRLEN_2 |      \
                                         QSPI_CTRL3_ADDRLEN_0)                               /*!< Address on 52 bits */
#define QSPI_ADDRESS_SIZE_56_BITS        (QSPI_CTRL3_ADDRLEN_3 | QSPI_CTRL3_ADDRLEN_2 |      \
                                         QSPI_CTRL3_ADDRLEN_1)                               /*!< Address on 56 bits */
#define QSPI_ADDRESS_SIZE_60_BITS        (QSPI_CTRL3_ADDRLEN_3 | QSPI_CTRL3_ADDRLEN_2 |      \
                                         QSPI_CTRL3_ADDRLEN_1 | QSPI_CTRL3_ADDRLEN_0)        /*!< Address on 60 bits */

/**
  * @}
  */

/** @defgroup QSPI_Flags QSPI Flags
 * @{
 */
#define QSPI_FLAG_BUSY                  QSPI_STS_BUSYF      /*!< QSPI busy flag                     */
#define QSPI_FLAG_TFN                   QSPI_STS_TFNF       /*!< QSPI transmit FIFO not full flag   */
#define QSPI_FLAG_TFE                   QSPI_STS_TFEF       /*!< QSPI transmit FIFO empty flag      */
#define QSPI_FLAG_RFNE                  QSPI_STS_RFNEF      /*!< QSPI receive FIFO not empty flag   */
#define QSPI_FLAG_RFF                   QSPI_STS_RFFF       /*!< QSPI receive FIFO full flag        */
#if defined(QSPI_STS_DCEF)
#define QSPI_FLAG_DCE                   QSPI_STS_DCEF       /*!< QSPI data collision error flag     */
#endif /* QSPI_STS_DCEF */
/**
  * @}
  */

/** @defgroup QSPI_Interrupts QSPI Interrupts
 * @{
 */
#define QSPI_IT_TFE                     QSPI_INTEN_TFEIE    /*!< QSPI transmit FIFO interrupt                       */
#define QSPI_IT_TFO                     QSPI_INTEN_TFOIE    /*!< QSPI transmit FIFO overflow interrupt              */
#define QSPI_IT_RFU                     QSPI_INTEN_RFUIE    /*!< QSPI receive FIFO underflow interrupt              */
#define QSPI_IT_RFO                     QSPI_INTEN_RFOIE    /*!< QSPI receive FIFO overflow interrupt               */
#define QSPI_IT_RFF                     QSPI_INTEN_RFFIE    /*!< QSPI receive FIFO full interrupt                   */
#if defined(QSPI_INTEN_MSTIE)
#define QSPI_IT_MST                     QSPI_INTEN_MSTIE    /*!< QSPI master operation complete interrupt           */
#endif /* QSPI_INTEN_MSTIE */
#define QSPI_IT_ICF                     0xFFFFFFFFU         /*!< QSPI FIFO status and master operation interrupt    */
/**
  * @}
  */

