betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_qspi.h
/** @defgroup QSPI_Timeout_definition QSPI Timeout definition
 * @{
 */
#define DAL_QSPI_TIMEOUT_DEFAULT_VALUE      5000U   /*!< 5 s */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup QSPI_Exported_Macros QSPI Exported Macros
  * @{
  */

/** @brief Reset QSPI handle state
 * @param  __HANDLE__ specifies the QSPI handle.
 * @retval None
 */
#if (USE_DAL_QSPI_REGISTER_CALLBACKS == 1)
#define __DAL_QSPI_RESET_HANDLE_STATE(__HANDLE__)   do{                                                   \
                                                        (__HANDLE__)->State             = DAL_QSPI_STATE_RESET; \
                                                        (__HANDLE__)->MspInitCallback   = NULL;                \
                                                        (__HANDLE__)->MspDeInitCallback = NULL;                \
                                                      } while(0)
#else
#define __DAL_QSPI_RESET_HANDLE_STATE(__HANDLE__)   ((__HANDLE__)->State = DAL_QSPI_STATE_RESET)
#endif /* USE_DAL_QSPI_REGISTER_CALLBACKS */

/**
 * @brief  Enable the specified QSPI peripheral.
 * @param  __HANDLE__ specifies the QSPI Handle.
 * @retval None
 */
#define __DAL_QSPI_ENABLE(__HANDLE__)               ((__HANDLE__)->Instance->SSIEN |= QSPI_SSIEN_EN)

/**
 * @brief  Disable the specified QSPI peripheral.
 * @param  __HANDLE__ specifies the QSPI Handle.
 * @retval None
 */
#define __DAL_QSPI_DISABLE(__HANDLE__)              ((__HANDLE__)->Instance->SSIEN &= ~QSPI_SSIEN_EN)

/**
 * @brief  Enable the slave select signal.
 * @param  __HANDLE__ specifies the QSPI Handle.
 * @retval None
 */
#define __DAL_QSPI_ENABLE_SS(__HANDLE__)            ((__HANDLE__)->Instance->SLAEN |= QSPI_SLAEN_SLAEN)

/**
 * @brief  Disable the slave select signal.
 * @param  __HANDLE__ specifies the QSPI Handle.
 * @retval None
 */
#define __DAL_QSPI_DISABLE_SS(__HANDLE__)           ((__HANDLE__)->Instance->SLAEN &= ~QSPI_SLAEN_SLAEN)

/**
 * @brief  Disable the specified QSPI clock output.
 * @param  __HANDLE__ specifies the QSPI Handle.
 * @retval None
 */
#define __DAL_QSPI_DISABLE_CLK(__HANDLE__)          ((__HANDLE__)->Instance->BR &= ~QSPI_BR_CLKDIV)

/**
 * @brief  Enable the specified QSPI interrupts.
 * @param  __HANDLE__ specifies the QSPI Handle.
 * @param  __INTERRUPT__ specifies the interrupt source to enable.
 *        This parameter can be one of the following values:
 *          @arg QSPI_IT_TFE: QSPI transmit FIFO interrupt
 *          @arg QSPI_IT_TFO: QSPI transmit FIFO overflow interrupt
 *          @arg QSPI_IT_RFU: QSPI receive FIFO underflow interrupt
 *          @arg QSPI_IT_RFO: QSPI receive FIFO overflow interrupt
 *          @arg QSPI_IT_RFF: QSPI receive FIFO full interrupt
 *          @arg QSPI_IT_MST: QSPI master operation complete interrupt (*)
 * @retval None
 */
#define __DAL_QSPI_ENABLE_IT(__HANDLE__, __INTERRUPT__)   ((__HANDLE__)->Instance->INTEN |= (__INTERRUPT__))

/**
 * @brief  Disable the specified QSPI interrupts.
 * @param  __HANDLE__ specifies the QSPI Handle.
 * @param  __INTERRUPT__ specifies the interrupt source to disable.
 *       This parameter can be one of the following values:
 *         @arg QSPI_IT_TFE: QSPI transmit FIFO interrupt
 *         @arg QSPI_IT_TFO: QSPI transmit FIFO overflow interrupt
 *         @arg QSPI_IT_RFU: QSPI receive FIFO underflow interrupt
 *         @arg QSPI_IT_RFO: QSPI receive FIFO overflow interrupt
 *         @arg QSPI_IT_RFF: QSPI receive FIFO full interrupt
 *         @arg QSPI_IT_MST: QSPI master operation complete interrupt (*)
 * @retval None
 */
#define __DAL_QSPI_DISABLE_IT(__HANDLE__, __INTERRUPT__)  ((__HANDLE__)->Instance->INTEN &= ~(__INTERRUPT__))

/**
 * @brief  Check whether the specified QSPI interrupt source is enabled or not.
 * @param  __HANDLE__ specifies the QSPI Handle.
 * @param  __INTERRUPT__ specifies the QSPI interrupt source to check.
 *        This parameter can be one of the following values:
 *         @arg QSPI_IT_TFE: QSPI transmit FIFO interrupt
 *         @arg QSPI_IT_TFO: QSPI transmit FIFO overflow interrupt
 *         @arg QSPI_IT_RFU: QSPI receive FIFO underflow interrupt
 *         @arg QSPI_IT_RFO: QSPI receive FIFO overflow interrupt
 *         @arg QSPI_IT_RFF: QSPI receive FIFO full interrupt
 *         @arg QSPI_IT_MST: QSPI master operation complete interrupt (*)
 * @retval The new state of __INTERRUPT__ (TRUE or FALSE).
 */
#define __DAL_QSPI_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__)  ((((__HANDLE__)->Instance->ISTS & (__INTERRUPT__)) == (__INTERRUPT__)) ? SET : RESET)

/**
 * @brief  Check whether the specified QSPI flag is set or not.
 * @param  __HANDLE__ specifies the QSPI Handle.
 * @param  __FLAG__ specifies the QSPI flag to check.
 *       This parameter can be one of the following values:
 *        @arg QSPI_FLAG_BUSY: QSPI busy flag
 *        @arg QSPI_FLAG_TFN: QSPI transmit FIFO not full flag
 *        @arg QSPI_FLAG_TFE: QSPI transmit FIFO empty flag
 *        @arg QSPI_FLAG_RFNE: QSPI receive FIFO not empty flag
 *        @arg QSPI_FLAG_RFF: QSPI receive FIFO full flag
 *        @arg QSPI_FLAG_DCE: QSPI data collision error flag (*)
 * @retval The new state of __FLAG__ (TRUE or FALSE).
 */
#define __DAL_QSPI_GET_FLAG(__HANDLE__, __FLAG__)  ((((__HANDLE__)->Instance->STS & (__FLAG__)) != 0U) ? SET : RESET)

/**
 * @brief  Clear the specified QSPI flag.
 * @param  __HANDLE__ specifies the QSPI Handle.
 * @param  __FLAG__ specifies the QSPI flag to clear.
 *       This parameter can be one of the following values:
 *        @arg QSPI_IT_TFO: QSPI transmit FIFO overflow interrupt
 *        @arg QSPI_IT_RFU: QSPI receive FIFO underflow interrupt
 *        @arg QSPI_IT_RFO: QSPI receive FIFO overflow interrupt
 *        @arg QSPI_IT_MST: QSPI master operation complete interrupt (*)
 *        @arg QSPI_IT_ICF: QSPI FIFO status and master operation interrupt
 * @retval None
 */
#if defined(QSPI_INTEN_MSTIE)
#define __DAL_QSPI_CLEAR_FLAG(__HANDLE__, __FLAG__)   do {                                                          \
                                                            __IO uint32_t tmpreg = 0x00U;                           \
                                                            if ((__FLAG__) == QSPI_IT_TFO)                          \
                                                            {                                                       \
                                                                tmpreg = (__HANDLE__)->Instance->TFOIC;             \
                                                            }                                                       \
                                                            else if ((__FLAG__) == QSPI_IT_RFU)                     \
                                                            {                                                       \
                                                                tmpreg = (__HANDLE__)->Instance->RFUIC;             \
                                                            }                                                       \
                                                            else if ((__FLAG__) == QSPI_IT_RFO)                     \
                                                            {                                                       \
                                                                tmpreg = (__HANDLE__)->Instance->RFOIC;             \
                                                            }                                                       \
                                                            else if ((__FLAG__) == QSPI_IT_MST)                     \
                                                            {                                                       \
                                                                tmpreg = (__HANDLE__)->Instance->MIC;               \
                                                            }                                                       \
                                                            else if ((__FLAG__) == QSPI_IT_ICF)                     \
                                                            {                                                       \
                                                                tmpreg = (__HANDLE__)->Instance->ICF;               \
                                                            }                                                       \
                                                            else                                                    \
                                                            {                                                       \
                                                                /* Do nothing */                                    \
                                                            }                                                       \
                                                            UNUSED(tmpreg);                                         \
                                                        } while(0)
#else
#define __DAL_QSPI_CLEAR_FLAG(__HANDLE__, __FLAG__)   do {                                                          \
                                                            __IO uint32_t tmpreg = 0x00U;                           \
                                                            if ((__FLAG__) == QSPI_IT_TFO)                          \
                                                            {                                                       \
                                                                tmpreg = (__HANDLE__)->Instance->TFOIC;             \
                                                            }                                                       \
                                                            else if ((__FLAG__) == QSPI_IT_RFU)                     \
                                                            {                                                       \
                                                                tmpreg = (__HANDLE__)->Instance->RFUIC;             \
                                                            }                                                       \
                                                            else if ((__FLAG__) == QSPI_IT_RFO)                     \
                                                            {                                                       \
                                                                tmpreg = (__HANDLE__)->Instance->RFOIC;             \
                                                            }                                                       \
                                                            else if ((__FLAG__) == QSPI_IT_ICF)                     \
                                                            {                                                       \
                                                                tmpreg = (__HANDLE__)->Instance->ICF;               \
                                                            }                                                       \
                                                            else                                                    \
                                                            {                                                       \
                                                                /* Do nothing */                                    \
                                                            }                                                       \
                                                            UNUSED(tmpreg);                                         \
                                                        } while(0)
#endif /* QSPI_INTEN_MSTIE */

 /**
  * @}
  */

/* Include GPIO DAL Extension module */
#include "apm32f4xx_dal_qspi_ex.h"

/* Exported functions --------------------------------------------------------*/
/** @addtogroup QSPI_Exported_Functions
  * @{
  */

