betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_qspi.h
/** @addtogroup QSPI_Exported_Functions_Group1
 * @{
 */

/* Initialization/de-initialization functions  ********************************/
DAL_StatusTypeDef   DAL_QSPI_Init(QSPI_HandleTypeDef *hqspi);
DAL_StatusTypeDef   DAL_QSPI_DeInit(QSPI_HandleTypeDef *hqspi);
void                DAL_QSPI_MspInit(QSPI_HandleTypeDef *hqspi);
void                DAL_QSPI_MspDeInit(QSPI_HandleTypeDef *hqspi);
/**
  * @}
  */

/** @addtogroup QSPI_Exported_Functions_Group2
 * @{
 */

/* I/O operation functions  ***************************************************/
/* QSPI IRQ handler method */
void                DAL_QSPI_IRQHandler(QSPI_HandleTypeDef *hqspi);

/* Transmit/Receive functions  ***********************************************/
DAL_StatusTypeDef   DAL_QSPI_Command(QSPI_HandleTypeDef *hqspi, QSPI_CommandTypeDef *cmd, uint32_t Timeout);
DAL_StatusTypeDef   DAL_QSPI_TransmitReceive(QSPI_HandleTypeDef *hqspi, uint8_t *data_out, uint8_t *data_in, uint32_t Size, uint32_t Timeout);
DAL_StatusTypeDef   DAL_QSPI_Transmit(QSPI_HandleTypeDef *hqspi, uint8_t *pData, uint32_t Timeout);
DAL_StatusTypeDef   DAL_QSPI_Receive(QSPI_HandleTypeDef *hqspi, uint8_t *pData, uint32_t Timeout);

DAL_StatusTypeDef   DAL_QSPI_Command_IT(QSPI_HandleTypeDef *hqspi, QSPI_CommandTypeDef *cmd);
DAL_StatusTypeDef   DAL_QSPI_TransmitReceive_IT(QSPI_HandleTypeDef *hqspi, uint8_t *data_out, uint8_t *data_in, uint32_t Size);
DAL_StatusTypeDef   DAL_QSPI_Transmit_IT(QSPI_HandleTypeDef *hqspi, uint8_t *pData);
DAL_StatusTypeDef   DAL_QSPI_Receive_IT(QSPI_HandleTypeDef *hqspi, uint8_t *pData);

DAL_StatusTypeDef   DAL_QSPI_Transmit_DMA(QSPI_HandleTypeDef *hqspi, uint8_t *pData);
DAL_StatusTypeDef   DAL_QSPI_Receive_DMA(QSPI_HandleTypeDef *hqspi, uint8_t *pData);

/* Callbacks functions  *******************************************************/
void                DAL_QSPI_ErrorCallback(QSPI_HandleTypeDef *hqspi);
void                DAL_QSPI_AbortCpltCallback(QSPI_HandleTypeDef *hqspi);

void                DAL_QSPI_CmdCpltCallback(QSPI_HandleTypeDef *hqspi);
void                DAL_QSPI_RxCpltCallback(QSPI_HandleTypeDef *hqspi);
void                DAL_QSPI_TxCpltCallback(QSPI_HandleTypeDef *hqspi);
void                DAL_QSPI_TxRxCpltCallback(QSPI_HandleTypeDef *hqspi);

#if (USE_DAL_QSPI_REGISTER_CALLBACKS == 1)
/* Callbacks Register/UnRegister functions  ***********************************/
DAL_StatusTypeDef   DAL_QSPI_RegisterCallback(QSPI_HandleTypeDef *hqspi, DAL_QSPI_CallbackIDTypeDef CallbackID, pQSPI_CallbackTypeDef pCallback);
DAL_StatusTypeDef   DAL_QSPI_UnRegisterCallback(QSPI_HandleTypeDef *hqspi, DAL_QSPI_CallbackIDTypeDef CallbackID);
#endif /* USE_DAL_QSPI_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @addtogroup QSPI_Exported_Functions_Group3
 * @{
 */

/* Peripheral Control and State functions  ************************************/
DAL_QSPI_StateTypeDef   DAL_QSPI_GetState(QSPI_HandleTypeDef *hqspi);
uint32_t                DAL_QSPI_GetError(QSPI_HandleTypeDef *hqspi);
DAL_StatusTypeDef       DAL_QSPI_Abort(QSPI_HandleTypeDef *hqspi);
DAL_StatusTypeDef       DAL_QSPI_Abort_IT(QSPI_HandleTypeDef *hqspi);
void                    DAL_QSPI_SetTimeout(QSPI_HandleTypeDef *hqspi, uint32_t Timeout);
DAL_StatusTypeDef       DAL_QSPI_SetTxFifoThreshold(QSPI_HandleTypeDef *hqspi, uint32_t Threshold);
DAL_StatusTypeDef       DAL_QSPI_SetTxFifoLevel(QSPI_HandleTypeDef *hqspi, uint32_t Level);
DAL_StatusTypeDef       DAL_QSPI_SetRxFifoThreshold(QSPI_HandleTypeDef *hqspi, uint32_t Threshold);
uint32_t                DAL_QSPI_GetTxFifoThreshold(QSPI_HandleTypeDef *hqspi);
uint32_t                DAL_QSPI_GetTxFifoLevel(QSPI_HandleTypeDef *hqspi);
uint32_t                DAL_QSPI_GetRxFifoThreshold(QSPI_HandleTypeDef *hqspi);

DAL_StatusTypeDef       DAL_QSPI_SetFrameFormat(QSPI_HandleTypeDef *hqspi, uint32_t FrameFormat);
DAL_StatusTypeDef       DAL_QSPI_SetDataFrameSize(QSPI_HandleTypeDef *hqspi, uint32_t DataFrameSize);
DAL_StatusTypeDef       DAL_QSPI_SetTransferMode(QSPI_HandleTypeDef *hqspi, uint32_t TransferMode);
DAL_StatusTypeDef       DAL_QSPI_SetFrameNbData(QSPI_HandleTypeDef *hqspi, uint32_t NbData);
uint32_t                DAL_QSPI_GetFrameFormat(QSPI_HandleTypeDef *hqspi);
uint32_t                DAL_QSPI_GetDataFrameSize(QSPI_HandleTypeDef *hqspi);
uint32_t                DAL_QSPI_GetTransferMode(QSPI_HandleTypeDef *hqspi);
uint32_t                DAL_QSPI_GetFrameNbData(QSPI_HandleTypeDef *hqspi);
/**
  * @}
  */

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup QSPI_Private_Macros QSPI Private Macros
  * @{
  */
#define IS_QSPI_CLOCK_PRESCALER(__PRESCALER__)  (((__PRESCALER__) >= 2U) && ((__PRESCALER__) <= 65534U) && (((__PRESCALER__) & 0x1U) == 0U))

#define IS_QSPI_FRAME_FORMAT(__FORMAT__)        (((__FORMAT__) == QSPI_FRAME_FORMAT_STANDARD) || \
                                                 ((__FORMAT__) == QSPI_FRAME_FORMAT_DUAL)     || \
                                                 ((__FORMAT__) == QSPI_FRAME_FORMAT_QUAD))

#define IS_QSPI_DATA_FRAME_SIZE(__SIZE__)       (((__SIZE__) >= 3U) && ((__SIZE__) <= 31U))

#define IS_QSPI_CLOCK_PHASE(__PHASE__)          (((__PHASE__) == QSPI_CLOCK_PHASE_1ST_EDGE) || \
                                                 ((__PHASE__) == QSPI_CLOCK_PHASE_2ND_EDGE))

#define IS_QSPI_CLOCK_POLARITY(__POLARITY__)    (((__POLARITY__) == QSPI_CLOCK_POLARITY_LOW) || \
                                                 ((__POLARITY__) == QSPI_CLOCK_POLARITY_HIGH))

#define IS_QSPI_CLOCK_STRETCH(__STRETCH__)      (((__STRETCH__) == ENABLE) || \
                                                 ((__STRETCH__) == DISABLE))

#define IS_QSPI_TX_FIFO_THRESHOLD(__THRESHOLD__)  ((__THRESHOLD__) <= 7U)

#define IS_QSPI_TX_FIFO_LEVEL(__LEVEL__)          ((__LEVEL__) <= 7U)

#define IS_QSPI_RX_FIFO_THRESHOLD(__THRESHOLD__)  ((__THRESHOLD__) <= 7U)

#define IS_QSPI_CHIP_SELECT_TOGGLE(__TOGGLE__)  (((__TOGGLE__) == QSPI_CS_TOGGLE_DISABLE) || \
                                                 ((__TOGGLE__) == QSPI_CS_TOGGLE_ENABLE))

#define IS_QSPI_TRANSFER_MODE(__MODE__)         (((__MODE__) == QSPI_TRANSFER_MODE_TX_RX)       || \
                                                 ((__MODE__) == QSPI_TRANSFER_MODE_TX)          || \
                                                 ((__MODE__) == QSPI_TRANSFER_MODE_RX)          || \
                                                 ((__MODE__) == QSPI_TRANSFER_MODE_EEPROM_READ))

#define IS_QSPI_RXD_SAMPLE_EDGE(__EDGE__)       (((__EDGE__) == QSPI_RXD_SAMPLE_EDGE_RISING) || \
                                                 ((__EDGE__) == QSPI_RXD_SAMPLE_EDGE_FALLING))

#define IS_QSPI_INSTRUCTION_SIZE(__SIZE__)      (((__SIZE__) == QSPI_INSTRUCTION_SIZE_NONE)  || \
                                                 ((__SIZE__) == QSPI_INSTRUCTION_SIZE_4_BITS) || \
                                                 ((__SIZE__) == QSPI_INSTRUCTION_SIZE_8_BITS) || \
                                                 ((__SIZE__) == QSPI_INSTRUCTION_SIZE_16_BITS))

#define IS_QSPI_INSTRUCTION_MODE(__MODE__)      (((__MODE__) == QSPI_INSTRUCTION_STANDARD_INS_ADDR) || \
                                                 ((__MODE__) == QSPI_INSTRUCTION_STANDARD_INS)      || \
                                                 ((__MODE__) == QSPI_INSTRUCTION_FRF_INS_ADDR))

#define IS_QSPI_INSTRUCTION(__INSTRUCTION__)    ((__INSTRUCTION__) <= 0xFFU)

#define IS_QSPI_ADDRESS_SIZE(__SIZE__)          ((__SIZE__) <= QSPI_ADDRESS_SIZE_60_BITS)

#define IS_QSPI_DUMMY_CYCLES(__CYCLES__)          ((__CYCLES__) <= 31U)

#define IS_QSPI_NB_DATA(__NUM__)          ((__NUM__) <= 0x10000U)

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* QSPI */

#ifdef __cplusplus
}
#endif

#endif /* __APM32F4XX_DAL_QSPI_H */

